CFDEM/CFDEMcoupling/tutorials/cfdemSolverReactingRhoPimple/packedBedAdiabatic/CFD/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

options
{
    limitTemperature
    {
        type            limitTemperature;
        active          yes;
        selectionMode   all;
        min             900;
        max             1500;
    }
}

//************************************************************************** //

