CFDEM/CFDEMcoupling/tutorials/cfdemSolverReactingRhoPimple/packedBedAdiabatic/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("libcatchyFiniteVolume.so");

application     cfdemSolverReactingRhoPimple;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.75;

deltaT          2e-5;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      2;

writeFormat     ascii;

writePrecision  15;

writeCompression uncompressed;

timeFormat      general;

timePrecision   7;

runTimeModifiable yes;

functions
{
    #includeFunc    "outletAverage"
}
// ************************************************************************* //
